<font color="blue">To use this notebook on Colaboratory, you will need to make a copy of it. Go to File > Save a Copy in Drive. You can then use the new copy that will appear in the new tab.</font>

# AfterWork Practice Notebook: Data Cleaning with Python

## 1. Standardisation

#### <font color="blue">Pre-requisites</font>

In [ ]:
# Pre-requisite 1
# ---
# Importing pandas library
# ---
# -> This is a data analysis and manipulation library with Python.
# ---
# OUR CODE GOES BELOW
# 
import pandas as pd

In [ ]:
# Pre-requisite 2
# ---
# Importing the numpy library
# -> This is a library for scientific computing with Python.
# -> It simply allows us to perfom complex mathematical operations.
# ---
# OUR CODE GOES BELOW
# 
import numpy as np

#### <font color="blue">Examples</font>

##### <font color="blue">Example 1</font>

In [ ]:
# Example 1
# --- 
# Renaming column names
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 

# Reading our dataset from the url
# ---
# We also specify the character ; as our separator
# ---
# 
df = pd.read_csv('http://bit.ly/DataCleaningDataset', ';')
df.head()

                NAME        CITY  ... ACCOUNT B  TOTAL ACCOUNT
0          Adi Dako   LISBON      ...      4340           6730
1          John Paul   LONDON     ...     34334          38834
2        Cindy Jules   Stockholm  ...      5504           8949
3      Arthur Kegels    BRUSSELS  ...      8999            300
4      Freya Bismark      Berlin  ...     19000          26000

[5 rows x 8 columns]

In [ ]:
# Example 1a
# --- 
# In this example, we will renaming our columns, if we have many column names.
# We will use the str.strip(), str.lower(), str.replace() functions 
# to ensure that our column names are in lowercase format that easily can work with.
# ---
# str.strip() - We use this function to remove leading and trailing characters.
# str.lower() - This function converts all characters to lowercase
# str.replace() - This functions is used replace text with some other text.
# ---
#
df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_').str.replace('(', '').str.replace(')', '')

# Then preview our dataframe
# ---
df.head()

                name        city  ... account_b  total_account
0          Adi Dako   LISBON      ...      4340           6730
1          John Paul   LONDON     ...     34334          38834
2        Cindy Jules   Stockholm  ...      5504           8949
3      Arthur Kegels    BRUSSELS  ...      8999            300
4      Freya Bismark      Berlin  ...     19000          26000

[5 rows x 8 columns]

In [ ]:
# Example 1b
# ---
# Alternatively we can rename column names in a dataframe manually by 
# specifying the column names that we would like to have. 
# Something to note is that this method becomes cumbersome when the no. of variables/features increase.
# ---
#

# We will reload our dataset again for this example and replace our dataframe
# with a new dataframe.
# ---
# 
df = pd.read_csv('http://bit.ly/DataCleaningDataset', ';') 

# We then specify our columns names, store them in a list, then afterwards
# assign the list to the column labels. By doing this, we replace the original
# columns with our new column names stored in the list.
# ---
# 
df.columns = ['name', 'city', 'country', 'height', 'weight', 'account_a', 'account_b', 'total_account']

# We then preview our dataframe as shown to confirm our changes
# ---
#
df.head()

                name        city  ... account_b  total_account
0          Adi Dako   LISBON      ...      4340           6730
1          John Paul   LONDON     ...     34334          38834
2        Cindy Jules   Stockholm  ...      5504           8949
3      Arthur Kegels    BRUSSELS  ...      8999            300
4      Freya Bismark      Berlin  ...     19000          26000

[5 rows x 8 columns]

##### <font color="blue">Example 2</font>

In [ ]:
# Example 2
# ---
# During standardisation, we can also perform string conversion. 
# In this example, we will convert the values of the column city to lower case values.
# From the previous example 1, we can see that the city column/feature has values 
# with Upppercase and Sentense case values.
# ---
# OUR CODE GOES BELOW
# 

# Lets convert the city column to comprise of only lowercase characters
# ---
# 
df['city'] = df['city'].str.lower()
df.head()

                name        city  ... account_b  total_account
0          Adi Dako   lisbon      ...      4340           6730
1          John Paul   london     ...     34334          38834
2        Cindy Jules   stockholm  ...      5504           8949
3      Arthur Kegels    brussels  ...      8999            300
4      Freya Bismark      berlin  ...     19000          26000

[5 rows x 8 columns]

##### <font color="blue">Example 3</font>

In [ ]:
# Example 3
# ---
# We now perform types of conversion that we would want i.e. metric conversion.
# In this example, we convert our height values to centimeters having in mind 
# that 1 inch = 2.54 cm.
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# 

# We perform our conversion across the column that we would want 
# then replace the column with the outcome of our conversion.
# ---
#
df['height'] = df['height'] * 2.54
df.head()

                name        city  ... account_b  total_account
0          Adi Dako   lisbon      ...      4340           6730
1          John Paul   london     ...     34334          38834
2        Cindy Jules   stockholm  ...      5504           8949
3      Arthur Kegels    brussels  ...      8999            300
4      Freya Bismark      berlin  ...     19000          26000

[5 rows x 8 columns]

##### <font color="blue">Example 4</font>

In [ ]:
# Example 4
# ---
# We can also perform other types of conversion such as datatype conversion as shown
# ---


# Let's first determine the column/feature datatypes
# ---
# 
df.dtypes

name              object
city              object
country           object
height           float64
weight           float64
account_a        float64
account_b          int64
total_account      int64
dtype: object

In [ ]:
# We then perform a conversion by converting our column/feature (height)
# through the use of the apply() function, passing the numerical 
# type (integer) provided by numpy as shown in this example.
# To get an understanding of other datatypes provided by numpy we can visit: 
# https://docs.scipy.org/doc/numpy/user/basics.types.html
# ---
# Other 
# ---
# 
df['height'] = df['height'].apply(np.int64)

# Let's now check whether our conversion happened by checking our updated datatypes.
# We want to see whether height feature was converted from float to integer.
# ---
# 
df.dtypes

name              object
city              object
country           object
height             int64
weight           float64
account_a        float64
account_b          int64
total_account      int64
dtype: object

In [ ]:
# We can also refer to our previous values of the height feature in example 2,
# and we will see that our height values now only comprise of integers.
# Let's now inspect and see whether our changes took place.
# We will sample 5 records from our dataset. Let's run this cell.
# ---
# 
df.sample(5)

#### <font color="green">Challenges</font>

In [ ]:
# Challenge 1
# ---
# Question: Convert the variables account_a and account_b to float datatype.
# ---
# Hint: You can refer to the dataset in the example.
# ---
# Dataset url = http://bit.ly/DataCleaningDataset

df['account_a']=df['account_a'].astype('float64')
df['account_b']=df['account_b'].astype('float64')

In [ ]:
# Challenge 2 (Optional)
# ---
# Question: Convert the given weight feature in the dataset from pounds to kgs. 
# ---
# Hint: 1 pound = 0.453592 kgs
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
df['weight']=df['weight']*0.453592
df.head()

                name        city  ... account_b  total_account
0          Adi Dako   lisbon      ...    4340.0           6730
1          John Paul   london     ...   34334.0          38834
2        Cindy Jules   stockholm  ...    5504.0           8949
3      Arthur Kegels    brussels  ...    8999.0            300
4      Freya Bismark      berlin  ...   19000.0          26000

[5 rows x 8 columns]

In [ ]:
# Challenge 3 (Optional)
# ---
# Question: Rename the columns in the following dataset to contain lowercase characters.
# ---
# Hint: Remember to use a different dataframe name other than df i.e. gv_df
# ---
# Dataset url = http://bit.ly/GVProjectsFunding
# ---
gv_df=gv_df['columns'].str(lower)

NameError: ignored

## 2. Syntax Errors

#### <font color="blue">Examples</font>

##### <font color="blue">Example 1</font>

In [ ]:
# Example 1
# --- 
# While performing our analysis, we can get to a point where we need to 
# fix spelling mistakes or typos. This example will show us how we can 
# go about this.
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 

# Let's replacing any value "GERMANYY" with the correct value "GERMANY".
# We use the string replace() function to perform our operation as shown.
# ---
# 
df['country'] = df['country'].str.replace('GERMANYY', 'GERMANY')
df.head()

                name        city  ... account_b  total_account
0          Adi Dako   lisbon      ...    4340.0           6730
1          John Paul   london     ...   34334.0          38834
2        Cindy Jules   stockholm  ...    5504.0           8949
3      Arthur Kegels    brussels  ...    8999.0            300
4      Freya Bismark      berlin  ...   19000.0          26000

[5 rows x 8 columns]

##### <font color="blue">Example 2</font>

In [ ]:
# Example 2
# ---
# We can also decide to strip or remove leading spaces (space infront) 
# and trailing spaces (spaces at the end) in our datset by using the 
# string strip() function covered in this example.
# ---
# Dataset = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 

# We first load our dataframe column with the intention to observ leading 
# and trailing spaces in the city column
# ---
# 
df['city']

0           lisbon
1            london
2            stockholm
3             brussels
4               berlin
5         brasilia
6            stockholm
7            london
Name: city, dtype: object

In [ ]:
# Then later we strip the leading and trailing spaces as shown and lastly 
# confirm our changes by previewing the city column
# ---
# 
df['city'] = df['city'].str.strip()
df['city']

0       lisbon
1       london
2    stockholm
3     brussels
4       berlin
5     brasilia
6    stockholm
7       london
Name: city, dtype: object

#### <font color="green">Challenges</font>

In [ ]:
# Challenge 1
# ---
# Question: Deal with the leading and trailing whitespaces from Name 
# and Team variables in the following dataset.
# ---
# Dataset url = http://bit.ly/NBABasketballDataset
# ---
df['name']=df['team'].str.(strip)
#

SyntaxError: ignored

In [ ]:
# Challenge 2 (Optional)
# ---
# Question: Fix the spelling errors in the Team variable where it states "oston Celtics" to "Boston Celtics"
# ---
# Hint: To solve this challenge, you can perform two steps i.e. 
# Step 1: Replace "oston Celtics" with "Boston Celtics"
# Step 2: Replace "BBoston Celtics" with "Boston Celtics"
# ---
# Dataset url = http://bit.ly/NBABasketballDataset
# ---
# OUR CODE GOES BELOW
#

## 3. Irrelevant Data

#### <font color="blue">Examples</font>

##### <font color="blue">Example 1</font>

In [ ]:
# Example 1
# --- 
# We can also delete/drop irrelevant columns/features. 
# By irrelevant we mean dataset features/columns that we don't need 
# to answer a research question. 
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
#

In [ ]:
# Deleting an Irrelevant Column i.e. if we don't require the column city 
# to answer our research question.
# ---
# While dropping/deleting those two columns:
# a) We set axis = 1
#    A dataframe has two axes: axis 0 and axis 1. 
#    axis 0 represents rows and axis 1 represents columns.
# b) We can also set Inplace = True.
#    This means the changes would be made to the original dataframe.
# Dropping the irrelevant columns i.e. Team and Weight
# Those values were dropped since axis was set equal to 1 and 
# the changes were made in the original data frame since inplace was True.
# 
df.drop(["city"], axis = 1, inplace = True) 
 
# And preview our resulting dataset
# ---
# 
df.head()

In [ ]:
# We can drop multiple columns as shown
# ---
# 
df.drop(["height", "weight"], axis = 1, inplace = True) 

# And preview our resulting dataset 
# --- 
# 
df.head()

##### <font color="blue">Example 2</font>

In [ ]:
# Example 2
# ---
# We can also fix in-record & cross-datasets errors. 
# These kinds errors result from having two or more values in the same row 
# or across datasets contradicting with each other.
# ---
# Dataset = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 
df['total_account_2'] = df['account_a'] + df['account_b']

# Previewing our resulting dataframe 
# ---
#
df.head()

In [ ]:
# Create another column to tell us whether if the two columns match.
# We will use the numpy library through use of np.
# ---
# 
df['total_account?'] = np.where(df['total_account'] == df['total_account_2'], 'True', 'False')

# Previewing our resulting dataframe 
# ---
# 
df.head()

In [ ]:
# Let's now select the records which don't match 
# ---
# 
df.loc[df['total_account?'] == "False"]

In [ ]:
# At this point we can do several things
# 1. Correct the values,
# 2. Drop/Delete the values,
# 3. Or even decide to leave them as they are for certain reasons
# ---
# If we had a large dataset, we could get the no. of records using len(),
# this would help us in our decision making process.
# ---
# 
len(df.loc[df['total_account?'] == "False"])

#### <font color="green">Challenges</font>

In [ ]:
# Challenge 1 
# ---
# Question: While perfoming some analysis to answer a research question, 
# we realize that we don't need the team and weight columns in our dataset. 
# Let's drop those two columns below
# ---
# Dataset url = http://bit.ly/NBABasketballDataset
# ---
# OUR CODE GOES BELOW
#

In [ ]:
# Challenge 2 (Optional)
# ---
# Question: Check for in-record and cross-dataset errors given the following dataset
# Hint: 
# -> Perform other data cleaning techniques that you have learned so far for ease of working.
# -> Total_Budget_Supported__by_Donors_KES = Total_-_Loan_Budget_Est_KES + Total_-_Grant_Budget_Est_KES
# ---
# Dataset url = http://bit.ly/GVProjectsFundingDataset
# ---
# OUR CODE GOES BELOW
#

## 4. Duplicates

#### <font color="blue">Examples</font>

##### <font color="blue">Example 1</font>

In [ ]:
# Example 1
# --- 
# Finding duplicate records
# -> Duplicate records are repeated records in a dataset.
# ---
# Dataset url = http://bit.ly/NBABasketballDataset
# ---
# OUR CODE GOES BELOW
# 

df = pd.read('http://bit.ly/NBABasketballDataset')
 
# Again, we first explore our dataset by determining the shape of 
# our dataset (records/instances, columns/variables)
# ---
# 
df.shape

In [ ]:
# We can then identify which observations are duplicates
# through the duplicated() function and sum() to know how many
# duplicate records there are.
# Normally, duplicate records are dropped from the dataset.
# But in our case we don't have any duplicate records.
# ---
#
df = df[~df.duplicated()]

In [ ]:
# Finding the no. of duplicates
# ---
# 
sum(df.duplicated())

##### <font color="blue">Example 2</font>

In [ ]:
# Example 2
# ---
# Dropping duplicate columns
# ---
# Dataset = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 

# In our previous dataset, if there were duplicates we
# could have dropped the through the use of the drop_duplicates() function 
# as shown in this example 
# ---
# 
df_duplicates = df.drop_duplicates()

##### <font color="blue">Example 3</font>

In [ ]:
# Example 3
# ---
# Dropping duplicates in a specific column
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
#

# We can also consider records with repeated variables/columns 
# as duplicates and deal with them. For example, we can 
# identify duplicates in our dataset based on country.
# ---
#  
duplicates_df = df[df.duplicated(['country'])] 
duplicates_df

In [ ]:
# Then dropping the duplicates as shown below.
# NB: We will create in a new dataframe object which will contain our unique dataframe
# which won't have any duplicates.
# --- 
# 
unique_df = df.drop_duplicates(['country'])

# Determining the size of our new dataset 
# We note that the two records were dropped from our original dataset
# ---
# 
unique_df.shape

#### <font color="green">Challenges</font>

##### <font color="green">Challenge 1</font>

In [ ]:
# Challenge 1
# ---
# Question: Find duplicates in the following dataset.
# ---
# Dataset url = http://bit.ly/StaffDataset
# ---
# OUR CODE GOES BELOW
#

##### <font color="green">Challenge 2</font>

In [ ]:
# Challenge 2 (Optional)
# ---
# Question: Dealing with duplicates in the given dataset.
# ---
# Dataset url = http://bit.ly/StaffDataset.
# ---
# OUR CODE GOES BELOW
#

## 5. Missing Data

#### <font color="blue">Examples</font>

##### <font color="blue">Example 1</font>

In [ ]:
# Example 1
# --- 
# Finding records with missing data
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 

# We can check if there is any missing values in the entire dataframe as shown 
# NB: This method may not be the most convenient. Why?
# ---
# 
df.isnull()

In [ ]:
# We can also check for missing values in each column 
# NB: This method may not be the most convenient. Why?
# Let's uncomment the following line
# ---
# 
df.isnull().any()

In [ ]:
# We can check how many missing values there are across each variable/column by 
# ---
# 
df.isnull().sum()

In [ ]:
# We can also check to see if we have any missing values in the dataframe by 
# ---
# 
df.isnull().values.any()

In [ ]:
# Lastly, We can also get a total count of missing values by 
#
# ---
df.isnull().sum().sum()

##### <font color="blue">Example 2</font>

In [ ]:
# Example 2
# ---
# Dealing with the missing data
# ---
# 

# We can drop rows where all cells in that row is NA
# Let's uncomment the following line
# NB: We don't have these rows in our dataset 
# ---
#
df_cleaned = df.dropna(how='all')
df_cleaned

In [ ]:
# We can also drop columns if they only contain missing values
# NB: We don't have these rows in our dataset 
# ---
# 
df_without_columns = df.dropna(axis=1, how='all')
df_without_columns

In [ ]:
# We can drop rows that contain less than five observations
# NB: We don't have these rows in our dataset 
# ---
# 
df.dropna(thresh=5)

In [ ]:
# Lastly, we can also drop the missing observations
# Let's uncomment the following two lines
# ---
#
df_no_missing = df.dropna()
df_no_missing


# There are many methods of dealing with missing data however, 
# we only dealt with the above basic ones due to time constraints.

##### <font color="blue">Example 3</font>

In [ ]:
# Example 3
# ---
# Flag missing values
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# 

# We can also fill in missing data with zeros as shown.
# NB: We will create a copy of the original dataframe
# Let's uncomment the following line 
# ---
# 
df2 = df.copy()
df3 = df2.fillna(0)
df3

#### <font color="green">Challenges</font>

In [ ]:
# Challenge 1
# ---
# Question: Find missing values in the following dataset.
# ---
# Dataset url = http://bit.ly/DCTitanicDataset
# ---
# OUR CODE GOES BELOW
#

In [ ]:
# Challenge 2 (Optional)
# ---
# Question: Drop the variables with more than 500 missing values.
# ---
# Dataset url = http://bit.ly/DCTitanicDataset
# ---
# OUR CODE GOES BELOW
#

## 6. Outliers

#### <font color="blue">Examples</font>

##### <font color="blue">Example 1</font>

In [ ]:
# Example 1
# --- 
# Given the following dataset, find and deal with outliers.
# ---
# Dataset url = http://bit.ly/CountryDataset1
# ---
# OUR CODE GOES BELOW
#  

# Let's read data from url as dataframe
# 
outliersc_df = pd.read_csv("http://bit.ly/CountryDataset1") 

# Lets preview our our dataframe below
#
outliersc_df.head()

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3  Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4  Afghanistan  1972  13079460.0      Asia   36.088  739.981106

In [ ]:
# Checking the size of our dataset for cleaning purposes
# ---
#
outliersc_df.shape

(1704, 6)

In [ ]:
# There are many ways of dealing with the outliers however in this session we wiil 
# use the interquartile range (IQR). 
# The IQR is the first quartile subtracted from the third quartile, 
# i.e. the range covered by the middle 50% of the data. Values outside this range
# will be considered as outliers. If we were to use a box plot visualisation then,
# we would be able to visually see those values outside this range. 
# Something to note is that this method will consider only the numerical values in 
# our dataset. Lets now calculate the IQR for each column.
# ---
#

# We first defining our quantiles using the quantile() function
# ---
# 
Q1 = outliersc_df.quantile(0.25)
Q3 = outliersc_df.quantile(0.75)
IQR = Q3 - Q1
IQR

# Then filtering out now filter out outliers by getting values which are outside our IQR Range.
# ---
#
outliers_df_iqr = outliersc_df[((outliersc_df < (Q1 - 1.5 * IQR)) | (outliersc_df > (Q3 + 1.5 * IQR))).any(axis=1)]

# Checking the size of the dataset with outliers for cleaning purposes
# ---
#
outliers_df_iqr.shape

In [ ]:
# We can also explore our outliers by doing the following
# ---
# 
outliersc_df_iqr

In [ ]:
# Lastly, the most common method of handling our outliers is to drop them.
# In some cases we can:
# 1. Leave them if they are genuine
# 2. Replace them with values within the IQR range
# 3. Drop them
# ---
# In our case, we will drop them.
# We just use the "~" character to refer to the other part of the dataset that 
# does not have outliers
# ---
# 
clean_dfc_iqr = outliersc_df[ ~((outliersc_df < (Q1 - 1.5 * IQR)) | (outliersc_df > (Q3 + 1.5 * IQR))).any(axis=1)]

# Checking the size of our final dataset.
clean_dfc_iqr.shape

#### <font color="green">Challenges</font>

In [ ]:
# Challenge 1 
# ---
# Question: Find and Deal with the outliers in the given dataset.
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
#